result_not_consolidated/4core_4iothread/ann(skylake)_not_consolidated_4core_4iothread/default/run1.txt
# run=1/5
# 2026-04-09T12:19:47+09:00

# cmd: taskset -c 4-15 ./bin/sysbench ./share/sysbench/oltp_read_write.lua
           --mysql-host=localhost
           --mysql-port=3306
           --mysql-user=sbuser
           --mysql-password=password
           --mysql-db=sbtest
           --tables=1
           --table_size=100
           --threads=16
           --time=60
           --rand-type=pareto
           --histogram=off
           run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            363412
        write:                           97856
        other:                           49729
        total:                           510997
    transactions:                        23771  (396.12 per sec.)
    queries:                             510997 (8515.30 per sec.)
    ignored errors:                      2187   (36.44 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      396.1223
    time elapsed:                        60.0092s
    total number of events:              23771

Latency (ms):
         min:                                    1.80
         avg:                                   40.39
         max:                                 1979.81
         95th percentile:                      179.94
         sum:                               960045.55

Threads fairness:
    events (avg/stddev):           1485.6875/18.13
    execution time (avg/stddev):   60.0028/0.00